Repository: ArkDeck/ArkDeck
Catalog: ArkDeckApp/Resources/DeviceLocalizable.xcstrings
Source language: en
Languages: zh_hans

# device.keyboard.focus
source: Move pointer
zh_hans: 移动指针

# device.keyboard.swipeEnd
source: Swipe to pointer
zh_hans: 滑动到指针

# device.keyboard.swipeStart
source: Set swipe start
zh_hans: 设置滑动起点

# device.keyboard.help
source: Focus the picture with Tab. Arrows move the pointer; Shift moves faster. Return or Space taps; Option-Return holds. Shift-Return sets a swipe start, then sends at the new position. Escape clears the start.
zh_hans: 按 Tab 聚焦画面。方向键移动指针，Shift 加速；回车或空格点击，Option-回车长按；Shift-回车设置滑动起点，移动后再按一次发送；Esc 清除起点。

# device.keyboard.title
source: Device keyboard pointer
zh_hans: 设备键盘指针

# device.preview.detail
source: Up to 60 seconds / 30 frames, with 2 seconds between captures. Stop preview before sending input or recording.
zh_hans: 最多 60 秒／30 帧，每次截图间隔 2 秒。操作设备或录屏前请停止预览。

# device.preview.contextChanged
source: Preview stopped · device or binding changed
zh_hans: 预览已停止 · 设备或绑定发生变化

# device.preview.limit
source: Preview finished · 60 seconds or 30 frames reached
zh_hans: 预览结束 · 已达 60 秒或 30 帧上限

# device.preview.stopping
source: Stopping · waiting for the current capture
zh_hans: 正在停止 · 等待本次截图结束

# device.preview.running
source: Refreshing screenshots
zh_hans: 正在刷新截图

# device.preview.stop
source: Stop preview
zh_hans: 停止预览

# device.preview.start
source: Start preview
zh_hans: 开始预览

# device.screen.picture
source: Device screenshot
zh_hans: 设备截图

# device.boundary
source: Preview refreshes still images. Each gesture is one typed operation; an unknown outcome is never resent.
zh_hans: 预览按次刷新静止画面。每个手势都是一次 typed operation；结果未知时绝不重发。

# device.frame.age
source: Picture taken
zh_hans: 画面拍摄于

# device.frame.none
source: No picture yet
zh_hans: 尚无画面

# device.frame.unknownAge
source: Picture age unknown
zh_hans: 画面年龄未知

# device.gesture.longPress
source: Long press
zh_hans: 长按

# device.gesture.swipe
source: Swipe
zh_hans: 滑动

# device.gesture.tap
source: Tap
zh_hans: 点击

# device.gestures.longPress
source: Hold for half a second to send a long press.
zh_hans: 按住半秒以上，发送一次长按。

# device.gestures.swipe
source: Drag to send a swipe; the time you held it is the swipe's duration.
zh_hans: 拖动发送一次滑动；你按住的时长就是滑动时长。

# device.gestures.tap
source: Click the picture to send a tap at that point.
zh_hans: 单击画面，在该点发送一次点击。

# device.gestures.title
source: How input works
zh_hans: 操作方式

# device.log.captureFailed
source: Screenshot failed
zh_hans: 截图失败

# device.log.captured
source: Screenshot captured
zh_hans: 已获取截图

# device.log.confirmed
source: confirmed
zh_hans: 已确认

# device.log.empty
source: Nothing sent yet.
zh_hans: 尚未发送任何操作。

# device.log.failed
source: failed
zh_hans: 失败

# device.log.title
source: Operation log
zh_hans: 操作记录

# device.log.unknown
source: outcome unknown
zh_hans: 结果未知

# device.screen.capture
source: Get screenshot
zh_hans: 获取截图

# device.screen.capturing
source: Capturing…
zh_hans: 正在获取截图…

# device.screen.empty.noTarget
source: Adopt exactly one device to use Device.
zh_hans: 接管且仅接管一台设备后才能使用真机操作。

# device.screen.empty.ready
source: Get a screenshot to act on the device.
zh_hans: 获取一张截图后即可在其上操作设备。

# device.screen.empty.title
source: No screenshot yet
zh_hans: 尚未获取截图

# device.stale.badge
source: Out of date
zh_hans: 已过期

# device.stale.refused
source: Not sent — this picture is out of date
zh_hans: 未发送——这张画面已经过期

# device.stale.refused.detail
source: Your last gesture changed the device. Get a new screenshot before pressing again; a point picked on this one no longer means what it did.
zh_hans: 上一个手势已经改变了设备。再点之前先取一张新截图——在这张图上选的位置，已经不是它原来指的东西了。

# device.target.none
source: No device
zh_hans: 无设备

# device.target.none.detail
source: Device sends device mutations and will not guess which device you meant.
zh_hans: 真机操作会写设备，因此不会替你猜是哪一台。

# device.record.title
source: Recording
zh_hans: 录屏

# device.record.start
source: Record
zh_hans: 录制

# device.record.stop
source: Stop
zh_hans: 停止

# device.record.frames
source: frames
zh_hans: 帧

# device.record.preflighting
source: Checking storage
zh_hans: 检查空间中

# device.record.capturing
source: Capturing
zh_hans: 采集中

# device.record.assembling
source: Assembling
zh_hans: 合成中

# device.record.validating
source: Validating
zh_hans: 校验中

# device.record.ready
source: Recording ready
zh_hans: 录屏已就绪

# device.record.failed
source: Recording failed
zh_hans: 录屏失败

# device.record.reveal
source: Show in Finder
zh_hans: 在访达中显示

# device.record.saveAs
source: Save As…
zh_hans: 另存为…

# device.record.saveFailed
source: Couldn’t save recording
zh_hans: 无法保存录屏

# device.record.again
source: Record again
zh_hans: 再录一段

# device.record.rate
source: measured
zh_hans: 实测

# device.record.gap
source: frames were lost
zh_hans: 帧丢失

# device.record.noTarget
source: Adopt exactly one device to record
zh_hans: 采纳且仅采纳一台设备才能录制

# device.record.ceiling
source: The device offers no recorder, so this is a run of stills composed here. About 1.8 a second is what its display readback allows.
zh_hans: 设备没有录屏接口，这是在本机把一串静止画面合成出来的。它的显示回读只允许约每秒 1.8 帧。

# device.record.timeline
source: Frames are laid out at the spacing they were taken at, not at an average.
zh_hans: 各帧按实际拍摄间距排布，不是按平均值。

# device.record.noRoom
source: Not enough room to keep this recording
zh_hans: 放不下这段录屏

# device.record.noRoom.detail
source: The artifact store refuses a new recording rather than deleting one you already have.
zh_hans: 制品库会拒绝新录屏，而不是删掉你已有的那一段。

# device.record.wouldFit
source: would fit
zh_hans: 放得下

# device.record.needs
source: needs
zh_hans: 需要

# device.record.free
source: free
zh_hans: 剩余

# device.record.headroomUnknown
source: Could not read the artifact store's remaining room, so this run was not checked against it. The runtime still refuses a recording it cannot keep.
zh_hans: 读不到制品库剩余空间，这次运行没有对它做检查。运行时仍会拒绝一段它存不下的录屏。

# device.performance.title
source: Capture affects device load
zh_hans: 截图会影响设备负载

# device.performance.detail
source: Preview and recording add device load. Stop capture before measuring baseline performance.
zh_hans: 预览和录屏都会增加设备负载。测量基线性能前请停止采集。

# device.input.accepted
source: Keyboard input accepted by injector
zh_hans: 键盘输入已被注入器接受

# device.input.clipboardConsent
source: Allow this text to replace the device clipboard
zh_hans: 允许这段文字替换设备剪贴板

# device.input.failed
source: Keyboard input not confirmed · inspect Job
zh_hans: 键盘输入未确认 · 查看 Job

# device.input.focusHelp
source: Send one key or text to the current focus on the default display. Refresh the picture after each input.
zh_hans: 向默认屏幕当前焦点发送一个按键或一段文字。每次输入后请刷新画面。

# device.input.key
source: Key
zh_hans: 按键

# device.input.key.arrowDown
source: Down arrow
zh_hans: 下方向键

# device.input.key.arrowLeft
source: Left arrow
zh_hans: 左方向键

# device.input.key.arrowRight
source: Right arrow
zh_hans: 右方向键

# device.input.key.arrowUp
source: Up arrow
zh_hans: 上方向键

# device.input.key.back
source: Device Back
zh_hans: 设备返回

# device.input.key.backspace
source: Backspace
zh_hans: 退格

# device.input.key.enter
source: Enter
zh_hans: 回车

# device.input.key.home
source: Device Home
zh_hans: 设备主页

# device.input.key.tab
source: Tab
zh_hans: 制表键

# device.input.privacyHelp
source: Text is retained as a sensitive local Artifact. Some input, including Chinese, uses the device clipboard. Success confirms injector acceptance; check the device for the result.
zh_hans: 文字保存为本地敏感 Artifact。中文等输入会使用设备剪贴板。成功仅表示注入器已接受，请查看设备确认结果。

# device.input.sendKey
source: Send key
zh_hans: 发送按键

# device.input.sendText
source: Send text
zh_hans: 发送文字

# device.input.text
source: Text · up to 512 UTF-8 bytes
zh_hans: 文字 · 最多 512 个 UTF-8 字节

# device.input.title
source: Device keyboard
zh_hans: 设备键盘

# device.input.unknown
source: Keyboard outcome unknown · no automatic resend
zh_hans: 键盘结果未知 · 不会自动重发
